Repository: IgorBaranov92/Sudoku
Catalog: Sudoku/*.lproj/Localizable.strings
Languages: ru

source: Rules
ru: Правила

source: Done
ru: Готово

# classicMessage
source: Completed games are always an example of a Latin square which include an additional constraint on the contents of individual regions. For example, the same single integer may not appear twice in the same row, column, or any of the nine 3×3 subregions of the 9×9 playing board.
ru: Заполните игровое поле так чтобы: -в каждой строке -в каждом столбце -в каждом квадрате 3х3 все цифры были разные

# ErrorNative
source: Can't erase native cell
ru: Нельзя стереть правильную цифру

# ErrorEmpty
source: Can't erase empty cell
ru: Нельзя стереть пустую клетку

# ErrorFilled
source: Already filled cell
ru: Уже заполненная клетка

source: Victory!
ru: Победа!

source: Mistakes
ru: Ошибок

source: Hints
ru: Подсказок

# mistakeslimit
source: For the game, depending on the level of difficulty, it is allowed to make a certain number of mistakes
ru: За игру, в зависимости от уровня сложности допускается совершить определенное количество ошибок

# mistakescheck
source: Automatically highlight a wrong digit
ru: Автоматически подсвечивать неправильно поставленную цифру

# areaselection
source: Highlight a row, column, 3x3 square (in some mode diagonal also) relative to the selected digit
ru: Подсвечивать строку, столбец, квадрат 3х3 (в некоторых режимах диагонали) относительно выбранной цифры

# smarthints
source: When you press any digit at the bottom of the screen, all cells where this digit cannot be placed will be highlighted
ru: При нажатии любой цифры в нижней части экрана будут подсвечены все клетки где эта цифра находиться не может

# hidedigits
source: Hide used numbers (for example, all units are arranged)
ru: Спрятать использованные цифры (например расcтавлены все единицы)

# timer
source: Time limited game (100 minutes)
ru: Игра с ограничением по времени (100 минут)

# darktheme
source: Turns on dark mode
ru: Включает темный режим

# darkmodesync
source: Turns on dark mode automatically
ru: Цветовой режим будет выбран автоматически

# nomistakeslimit
source: Any number of errors allowed
ru: Допускается любое количество ошибок

# nomistakescheck
source: Do not highlight the wrong digit
ru: Не подсвечивать неправильно поставленную цифру

# noareaselection
source: Highlight only the selected cell
ru: Выделять только выбранную клетку

# nosmarthints
source: When you press any digit at the bottom of the screen, all the same digits on the playing field will be highlighted
ru: При нажатии любой цифры в нижней части экрана будут подсвечены все цифры на игровом поле

# nohidedigits
source: Do not hide used numbers
ru: Не скрывать использованные цифры

# notimer
source: No time limit
ru: Игра без ограничения по времени

# nodarktheme
source: Turns on light mode
ru: Включает светлый режим

# nodarkmodesync
source: Сolor mode will be selected depending on the settings
ru: Цветовой режим будет выбран в зависимости от настроек

source: Classic
ru: Классика

source: Diagonal
ru: Диагональ

source: Two diagonals
ru: Две диагонали

source: Romb
ru: Ромб

source: Even-Odd
ru: Чет-нечет

source: Fence
ru: С перегородками

source: Mistakes made
ru: Ошибок допущено

source: Hints used
ru: Подсказок использовано

source: Game won
ru: Выигранных игр

source: Game lost
ru: Проигранных игр

source: Best time
ru: Лучшее время

source: Attention!
ru: Внимание!

# ResetAllWarning
source: Are you sure to reset all statistic? It can't be undone
ru: Вы действительно хотите стереть всю статистику? Действие нельзя отменить

source: No
ru: Нет

source: Yes
ru: Да

source: Easy
ru: Легкий

source: Medium
ru: Средний

source: Hard
ru: Тяжелый
