import Foundation


struct Descriptions {
    
    static let optionsOnDescription = ["В каждой игре допускается совершить три ошибки","Выделять неправильно поставленную цифру","Выделять все области, где цифра не должна повториться (строка, столбец, диагональ и тд)","При нажатии на цифру в нижней части экрана выделять все области где эта цифра не может быть расставлена","Скрывать цифры, расставленные 9 раз"]
    
    static let optionsOffDescription = ["Допускается любое количество ошибок","Не выделять неправильно поставленную цифру","Выделять только выбранную клетку","При нажатии на цифру в нижней части экрана выделять","Не скрывать цифры, расставленные 9 раз"]
}
